---
kind: method
id: M:Autodesk.Revit.DB.View.GetDirectContext3DHandleOverrides
zh: 视图
source: html/c3671906-2049-5bb7-c9b9-b22e1c813509.htm
---
# Autodesk.Revit.DB.View.GetDirectContext3DHandleOverrides Method

**中文**: 视图

Returns DirectContext3D handle overrides object for the view.

## Syntax (C#)
```csharp
public DirectContext3DHandleOverrides GetDirectContext3DHandleOverrides()
```

## Returns
DirectContext3D handle overrides for the view